import { Header } from "@/modules/components/landing/Header";
import Footer from "@/modules/components/landing/Footer";
import fgf_policy01 from "@/assets/fgf-policy-01.jpg";
import fgf_policy02 from "@/assets/fgf-policy-02.jpg";
import Image from "next/image";

function Fgf_Policy() {
  return (
    <>
      <Header />
      <div className="page-wrapper bg-gradient-to-b from-primary/10 to-primary/5 px-4 py-10 lg:px-0 lg:py-12">
        <main className="max-w-5xl mx-auto p-4 lg:p-10 shadow-lg rounded-lg border border-gray-100 bg-white">
          <h2 className="text-xl text-center">ข้อกำหนดและเงื่อนไข</h2>
          <h2 className="text-2xl text-center text-primary mb-5"><span className="hidden lg:inline">AssetWise Creator Club - </span>Friend Get Friends</h2>
          <div className="privacy-policy-content">
            <h3 className="lg:mb-4 mb-2">หลักเกณฑ์ วิธีการ เงื่อนไข</h3>
            <p>“ผู้แนะนำ” หมายถึง ลูกค้า ลูกบ้าน หรือบุคคลทั่วไป ที่ต้องการแนะนำเพื่อนญาติหรือลูกค้า มาจองบ้านหรือห้องชุดกับบริษัท แอสเซทไวส์ จำกัด (มหาชน) และบริษัทในเครือ (เฉพาะยูนิตและโครงการที่บริษัทฯ กำหนด รายละเอียดยูนิตและโครงการที่เข้าร่วม สอบถามเพิ่มเติมได้ที่สำนักงานขายโครงการนั้น ๆ หรือ <a href='tel:02-168-0000' className='text-primary underline'>02-168-0000</a>)</p>
            <div className="h-7"></div>
            <h4 className="font-medium mb-5">โปรโมชั่นสำหรับ 36 โครงการที่เข้าร่วมแคมเปญ รับค่าแนะนําสูงสุด 500,000 บาท* ดังนี้</h4>
            <Image src={fgf_policy01} alt=""/>
            <Image src={fgf_policy02} alt=""/>
            <div className="h-7"></div>
            <h4 className="font-medium mb-5">เงื่อนไขการเข้าร่วมแคมเปญ</h4>
            <ol className="list-decimal list-inside flex flex-col gap-2 font-normal">
              <li>“ผู้แนะนำ” โดยจะต้องแนะนำผ่านทางเว็บไซต์ของบริษัทฯ ในหน้าลงทะเบียนแนะนำของ Creator Club ที่ <a href="https://assetwise.co.th/friendgetfriends" className="text-primary underline">https://assetwise.co.th/friendgetfriends</a> เท่านั้น โดยผู้แนะนำต้องกรอกข้อมูลแจ้งชื่อ ”ผู้ถูกแนะนำ”อย่างน้อย 3 วันก่อนการซื้อขาย</li>
              <li>“ผู้ถูกแนะนำ” จะต้องเป็นผู้ที่ไม่มีชื่ออยู่ในฐานข้อมูลลูกค้าของบริษัทฯ ภายใน 6 เดือน นับจากวันที่ถูกแนะนำย้อนกลับขึ้นไป หากบริษัทฯ ตรวจสอบแล้วพบว่า รายชื่อผู้ถูกแนะนำมีอยู่ในฐานข้อมูลของบริษัทฯในช่วงเวลาดังกล่าว ผู้แนะนำไม่มีสิทธิ์ในการรับค่าแนะนำ</li>
              <li>ระยะเวลาโปรโมชั่นส่งเสริมการขาย Friend Gets Friends ผู้ถูกแนะนำจะต้องจองซื้อ ทำสัญญาจะซื้อจะขาย พร้อมทั้งชำระเงินจองและเงินทำสัญญา ตั้งแต่วันที่ 1 เมษายน พ.ศ. 2569 - 31 ธันวาคม พ.ศ. 2569 และสำหรับโครงการพร้อมอยู่ผู้ถูกแนะนำจะต้องจดทะเบียนและรับโอนกรรมสิทธิ์ห้องชุดภายในระยะเวลาที่ทางบริษัทฯกำหนดเท่านั้น โดยวันและเวลาที่กำหนดในการทำสัญญาและ/หรือจดทะเบียนและรับโอนกรรมสิทธิ์ จะถือตามวันที่บันทึกและ/หรือรับเงินในระบบของบริษัทฯ เท่านั้น</li>
              <li>โปรโมชั่น Friend Gets Friends สำหรับโครงการพร้อมอยู่ ผู้แนะนำจะได้รับค่าแนะนำเป็นเช็คเงินสด ตามมูลค่าของค่าแนะนำประเภทยูนิตนั้นๆ โดยจะได้รับค่าแนะนำภายใน 60 วัน หลังจากผู้ถูกแนะนำจดทะเบียนและรับโอนกรรมสิทธิ์ห้องชุดตามข้อกำหนดของรายการส่งเสริมการขายนี้ และผู้แนะนำจะต้องชำระค่าภาษีหัก ณ ที่จ่าย 10% จากมูลค่าเงินรางวัลที่ได้รับหรือตามที่กฎหมายกำหนด</li>
              <li>โปรโมชั่น Friend Gets Friends สำหรับโครงการพรีเซลล์ ผู้แนะนำจะได้รับค่าแนะนำเป็นเช็คเงินสด ตามมูลค่าของค่าแนะนำประเภทยูนิตนั้นๆ โดยจะได้รับค่าแนะนำภายใน 60 วัน หลังจากผู้ถูกแนะนำจ่ายค่าผ่อนดาวน์ ครบตามเงื่อนไขที่โครงการกำหนดหรือหลังโอนกรรมสิทธิ์ภายใน 60 วัน และผู้แนะนำจะต้องชำระค่าภาษีหัก ณ ที่จ่าย 10% จากมูลค่าเงินรางวัลที่ได้รับหรือตามที่กฎหมายกำหนด</li>
              <li>บริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงขั้นตอน และวิธีการร่วมกิจกรรม ตลอดจนถึงข้อกำหนด และเงื่อนไขโดยไม่ต้องแจ้งให้ทราบล่วงหน้าหากมีข้อโต้แย้งใดๆ เกิดขึ้น ไม่ว่าจะเป็นโดยทางตรง หรือทางอ้อม ให้ถือเอาการตัดสินใจของบริษัทฯ เป็นที่สุด</li>
              <li>พนักงานฝ่ายขายของบริษัทฯ ไม่มีสิทธิ์เข้าร่วมรายการส่งเสริมการขายนี้</li>
              <li>สามารถสอบถามรายละเอียดเพิ่มเติมได้ที่โทร 02 168 0000</li>
              <li>บริษัทฯ หมายถึง บริษัท แอสเซทไวส์ จำกัด (มหาชน)/หรือบริษัทในเครือ</li>
            </ol>
          </div>
        </main>
      </div>
      <Footer/>
    </>
  );
}

export default Fgf_Policy;