import { Header } from "@/modules/components/landing/Header";
import Footer from "@/modules/components/landing/Footer";
import aff_policy01 from "@/assets/aff-policy-01.jpg";
import aff_policy02 from "@/assets/aff-policy-02.jpg";
import Image from "next/image";

function TermsAndConditions() {
  return (
    <>
      <Header />
      <div className="page-wrapper bg-gradient-to-b from-primary/10 to-primary/5 px-4 py-10 lg:px-0 lg:py-12">
        <main className="max-w-5xl mx-auto p-4 lg:p-10 shadow-lg rounded-lg border border-gray-100 bg-white">
          <h2 className="text-xl text-center">ข้อกำหนดและเงื่อนไข</h2>
          <h2 className="text-2xl text-center text-primary mb-5">AssetWise Creator Club</h2>
          <div className="privacy-policy-content">
            <h4 className="font-medium mb-5">เงื่อนไขการเข้าร่วมแคมเปญ</h4>
            <ol className="list-decimal list-inside flex flex-col gap-2 font-normal">
              <li>เงื่อนไขและรายละเอียดการเข้าร่วมแคมเปญ Affiliate เพื่อโปรโมตโครงการบ้าน ทาวน์โฮม และคอนโดมิเนียมของบริษัท แอสเซทไวส์ จำกัด (มหาชน) หรือบริษัทในเครือ ผู้สมัครเข้าร่วมแคมเปญได้ตั้งแต่ 1 เมษายน 2569 - 31 ธันวาคม 2569 เท่านั้น ระยะเวลาเริ่มโปรโมต ตั้งแต่ 1 เมษายน 2569 - 31 ธันวาคม 2569 เท่านั้น</li>
              <li>ผู้สมัครต้องกรอกข้อมูลในแบบฟอร์มการสมัครให้ครบถ้วนและตรวจสอบถามถูกต้องก่อนลงทะเบียนสมัคร โดยบริษัทฯ จะแจ้งผลการคัดเลือกทราบภายใน 7 วัน ทางอีเมลที่ผู้สมัครให้ข้อมูลไว้</li>
              <li>ผู้สมัครที่ได้รับคัดเลือกจะได้รับการเชิญเข้ากลุ่ม Line Open Chat พร้อม Code เพื่อ Log in เข้าสู่กลุ่ม Line Open Chat ของ AssetWise Creator Club</li>
              <li>ผู้สมัครที่ได้รับคัดเลือกจะสามารถเข้าดู Dashboard ได้ โดยใช้ E-mail และ Password ที่สมัครเข้ามา โดยจะสามารถเข้าดูได้ตั้งแต่ 1 เมษายน 2569 – 31 ธันวาคม 2569 เพื่อตรวจสอบสรุปผลงานประจำสัปดาห์บน Dashboard ในกรณีที่ผู้สมัครไม่มีผลงาน หรือความเคลื่อนไหวนานเกิน 6 เดือนติดต่อกัน ผู้สมัครจะถูกตัดสิทธิ์ในการเข้าดู Dashboard ทันที</li>
              <li>เมื่อผ่านการคัดเลือกเป็น Creator ของ AssetWise แล้ว สามารถเริ่มจัดทำโพสต์โปรโมตขึ้นเอง โดยทำได้ทั้งการโพสต์เป็นรูปภาพ  คลิปวีดีโอ Blog หรือ Liveสด ทั้งนี้ห้ามคัดลอกเนื้อหาภาพ, เสียง หรือข้อความ ที่ละเมิดลิขสิทธิ์ของผู้อื่นโดยเด็ดขาด หากตรวจสอบแล้วพบว่ามีการคัดลอก แก้ไขดัดแปลง หรือละเมิดลิขสิทธิ์ของผู้อื่นมา ทางบริษัทฯขอตัดสิทธิ์ ของผู้สมัครออกจากแคมเปญ AssetWise Creator Club ทันทีโดยไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
              <li>ข้อมูลในการโปรโมตจะต้องมีเนื้อหารายละเอียดของโครงการฯ ตรงกับข้อมูลFact Sheet หรือเอกสารขายที่ได้รับจากทางบริษัท แอสเซทไวส์ เท่านั้น</li>
              <li>การโปรโมทโพสต์ลงสื่อโซเชียลมีเดียในช่องทางต่าง ๆ จะต้องมีเนื้อหาที่ขัดต่อคุณธรรม จริยธรรม ห้ามมีเนื้อหารุนแรง อนาคาร สะเทือนอารมณ์ ส่อเสียด ดูหมื่น หรือมีการพาดพิงบุคคลอื่น ไม่มีเนื้อหาส่งเสริมการกระทำที่ผิดกฎหมาย สร้างผลกระทบต่อสังคม หรือมีเนื้อหาที่ไม่เหมาะสม หากทางบริษัทฯ พบว่ามีการโพสต์มีเนื้อหาที่ไม่เหมาะสมตามที่กล่าวมา บริษัทฯ มีสิทธิ์ตัดสิทธิ์ผู้สมัครออกจากแคมเปญได้ทันที โดยที่ไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
              <li>ผู้สมัครสามารถทำโพสต์โปรโมตได้มากกว่า 1 โครงการ แต่ละโครงการสามารถสร้างโพสต์โปรโมทได้ไม่จำกัดจำนวนโพสต์ และทุกโพสต์ต้องตั้งค่าให้เป็นสาธารณะ</li>
              <li>ผู้สมัครจะไม่สามารถลงทะเบียนสนใจโครงการ ผ่านลิ้งค์หรือโพสต์โปรโมตของตนเองได้</li>
              <li>ผู้สมัครไม่สามารถนำลิ้งค์ของบุคคลอื่น จากโพสต์ของผู้สมัครท่านอื่น มาทำโพสต์โปรโมทของตนเองได้ เนื่องจากแต่ละลิ้งค์จะมีการติด UTM สำหรับวัดผลเป็นรายบุคคลไว้เฉพาะ</li>
              <li>หากผู้สมัครต้องการเข้าไปถ่ายภาพหรือคลิปวีดีโอที่โครงการ จะต้องทำนัดหมายผ่าน Line Official Account @asw.creatorclub ก่อนเท่านั้น โดยแจ้งอย่างน้อยล่วงหน้า 7 วัน และต้องได้รับการ Confirm กลับจากบริษัทแล้วเท่านั้นจึงจะสามารถเข้าดำเนินการถ่ายทำที่โครงการได้</li>
              <li>ระยะเวลาโปรโมชั่นส่งเสริมการขาย Affiliate Program ผู้ถูกแนะนำจะต้องจองซื้อ ทำสัญญาจะซื้อจะขาย พร้อมทั้งชำระเงินจองและเงินทำสัญญา ตั้งแต่วันที่ 1 เมษายน พ.ศ. 2569 - 31 ธันวาคม พ.ศ. 2569 และสำหรับโครงการพร้อมอยู่ผู้ถูกแนะนำจะต้องจดทะเบียนและรับโอนกรรมสิทธิ์ห้องชุดภายในระยะเวลาที่ทางบริษัทฯกำหนดเท่านั้น โดยวันและเวลาที่กำหนดในการทำสัญญาและ/หรือจดทะเบียนและรับโอนกรรมสิทธิ์ จะถือตามวันที่บันทึกและ/หรือรับเงินในระบบของบริษัทฯ เท่านั้น</li>
              <li>โปรโมชั่น Affiliate Program สำหรับโครงการพร้อมอยู่ ผู้แนะนำจะได้รับค่าแนะนำเป็นเช็คเงินสด ตามมูลค่าของค่าแนะนำประเภทยูนิตนั้นๆ โดยจะได้รับค่าแนะนำภายใน 60 วัน หลังจากผู้ถูกแนะนำจดทะเบียนและรับโอนกรรมสิทธิ์ห้องชุดตามข้อกำหนดของรายการส่งเสริมการขายนี้ และผู้แนะนำจะต้องชำระค่าภาษีหัก ณ ที่จ่าย 10% จากมูลค่าเงินรางวัลที่ได้รับหรือตามที่กฎหมายกำหนด</li>
              <li>โปรโมชั่น Affiliate Program สำหรับโครงการพรีเซลล์ ผู้แนะนำจะได้รับค่าแนะนำเป็นเช็คเงินสด ตามมูลค่าของค่าแนะนำประเภทยูนิตนั้นๆ โดยจะได้รับค่าแนะนำภายใน 60 วัน หลังจากผู้ถูกแนะนำจ่ายค่าผ่อนดาวน์ ครบตามเงื่อนไขที่โครงการกำหนดหรือหลังโอนกรรมสิทธิ์ภายใน 60 วัน และผู้แนะนำจะต้องชำระค่าภาษีหัก ณ ที่จ่าย 10% จากมูลค่าเงินรางวัลที่ได้รับหรือตามที่กฎหมายกำหนด</li>
              <li>บริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงขั้นตอน และวิธีการร่วมกิจกรรม ตลอดจนถึงข้อกำหนด และเงื่อนไขโดยไม่ต้องแจ้งให้ทราบล่วงหน้าหากมีข้อโต้แย้งใดๆ เกิดขึ้น ไม่ว่าจะเป็นโดยทางตรง หรือทางอ้อม ให้ถือเอาการตัดสินใจของบริษัทฯ เป็นที่สุด</li>
              <li>ลิขสิทธิ์ในการโปรโมทโพสต์ถือเป็นลิขสิทธิ์ของบริษัทฯ</li>
              <li>พนักงานฝ่ายขายของบริษัทฯ ไม่มีสิทธิ์เข้าร่วมรายการส่งเสริมการขายนี้</li>
              <li>สามารถดูรายละเอียดเพิ่มเติมได้ที่ Line OA : <span className="text-primary">@asw.creatorclub</span> หรือโทร <a href='tel:02-168-0000' className='text-primary underline'>02-168-0000</a></li>
              <li>บริษัทฯ หมายถึง บริษัท แอสเซทไวส์ จำกัด (มหาชน)/หรือบริษัทในเครืv</li>
            </ol>
            <div className="h-10"></div>
            <h4 className="font-medium mb-2">อัตราการจ่ายค่าตอบแทน</h4>
            <p>สำหรับสมาชิก AssetWise Creator Club ที่ Get Link จากหน้า Website และสามารถแนะนำเพื่อนญาติหรือลูกค้า มาจองบ้านหรือห้องชุดกับบริษัท แอสเซทไวส์ จำกัด (มหาชน)และบริษัทในเครือ (เฉพาะยูนิตและโครงการที่บริษัทฯ กำหนด รายละเอียดยูนิตและโครงการที่เข้าร่วม สอบถามเพิ่มเติมได้ที่สำนักงานขายโครงการนั้นๆหรือ <a href='tel:02-168-0000' className='text-primary underline'>02-168-0000</a>)</p>
            <p>ตราการจ่ายค่าตอบแทน สำหรับ 36 โครงการที่เข้าร่วมแคมเปญ รับค่าแนะนําสูงสุด 500,000 บาท* AFFILIATE COMMISSION RATE 2026 ดังนี้</p>
            <div className="h-5"></div>
            <Image src={aff_policy01} alt=""/>
            <Image src={aff_policy02} alt=""/>
          </div>
        </main>
      </div>
      <Footer/>
    </>
  );
}

export default TermsAndConditions;